package semex1;

public class hw1_2 {
//Посмотрите на код, и подумайте сколько разных типов исключений вы тут сможете получить? 
//public static int sum2d(String[][] arr) {
//    int sum = 0;
//    for (int i = 0; i < arr.length; i++) {
//        for (int j = 0; j < 5; j++) {
//            int val = Integer.parseInt(arr[i][j]);
//            sum += val;
//        }
//    }
//    return sum;
//}
//1. Исключение на тип данных. В массиве могут быть не только числа и числа не типа int
//2. Исключение на величину данных. В массиве могут быть элементы выходящие за предел типа int 
// от −2 147 483 648 до 2 147 483 647 
//
}
